; domain
(define (domain flow)

    (:requirements :strips :typing)

    (:types
        color
        location
    )

    (:predicates
        ;The finger is off the board, we can begin any flow
        (offboard)
        ; the location has no color
        (empty ?l - location)
        ; negation of empty predicate
        (not-empty ?l - location)
        ; the location l has color c
        (color-at ?l - location ?c - color )
        ; l1 is an adjacent location to l2
        (adjacent ?l1 - location ?l2 - location)
        ; l is the end point for the flow of color c
        (flow-end ?l - location ?c - color)
        ; the player is at l1 drawing a flow of color c
        (flow-at ?l1 - location ?c - color)
        ; the flow for color c is completed
        (flow-complete ?c - color)
    )

    ;start the flow of color c
    (:action start
        :parameters (?l - location ?c - color)
        :precondition (and (offboard) (empty ?l) (flow-end ?l ?c)) 
        :effect (and (not (offboard)) (not (empty ?l)) (not-empty ?l) (flow-at ?l ?c) (color-at ?l ?c))
    )

    (:action move
        :parameters (?l1  ?l2 - location ?c - color)
        :precondition (and (flow-at ?l1 ?c) (empty ?l2) (adjacent ?l1 ?l2)) 
        :effect (and (not (flow-at ?l1 ?c)) (not (empty ?l2)) (flow-at ?l2 ?c) (not-empty ?l2) (color-at ?l2 ?c))
    )

    ;end the flow of color c
    (:action finish
        :parameters (?l1  ?l2 - location ?c - color)
        :precondition (and (flow-at ?l1 ?c) (empty ?l2) (flow-end ?l2 ?c) (adjacent ?l1 ?l2)) 
        :effect (and (not (flow-at ?l1 ?c)) (not (empty ?l2)) (not-empty ?l2) (offboard) (color-at ?l2 ?c) (flow-complete ?c))
    )
)

; problem
(define (problem flow_5_5) (:domain flow)
(:objects 
    c_5
	c_1
	c_4
	c_2
	c_6
	c_3 - color
    p_0_0
	p_0_1
	p_0_2
	p_0_3
	p_0_4
	p_1_0
	p_1_1
	p_1_2
	p_1_3
	p_1_4
	p_2_0
	p_2_1
	p_2_2
	p_2_3
	p_2_4
	p_3_0
	p_3_1
	p_3_2
	p_3_3
	p_3_4
	p_4_0
	p_4_1
	p_4_2
	p_4_3
	p_4_4 - location
)

(:init
    (offboard)
    (empty p_0_0)
	(empty p_0_1)
	(empty p_0_2)
	(empty p_0_3)
	(empty p_0_4)
	(empty p_1_0)
	(empty p_1_1)
	(empty p_1_2)
	(empty p_1_3)
	(empty p_1_4)
	(empty p_2_0)
	(empty p_2_1)
	(empty p_2_2)
	(empty p_2_3)
	(empty p_2_4)
	(empty p_3_0)
	(empty p_3_1)
	(empty p_3_2)
	(empty p_3_3)
	(empty p_3_4)
	(empty p_4_0)
	(empty p_4_1)
	(empty p_4_2)
	(empty p_4_3)
	(empty p_4_4)
    (adjacent p_0_0 p_1_0)
	(adjacent p_0_0 p_0_1)
	(adjacent p_0_1 p_1_1)
	(adjacent p_0_1 p_0_2)
	(adjacent p_0_1 p_0_0)
	(adjacent p_0_2 p_1_2)
	(adjacent p_0_2 p_0_3)
	(adjacent p_0_2 p_0_1)
	(adjacent p_0_3 p_1_3)
	(adjacent p_0_3 p_0_4)
	(adjacent p_0_3 p_0_2)
	(adjacent p_0_4 p_1_4)
	(adjacent p_0_4 p_0_3)
	(adjacent p_1_0 p_2_0)
	(adjacent p_1_0 p_1_1)
	(adjacent p_1_0 p_0_0)
	(adjacent p_1_1 p_2_1)
	(adjacent p_1_1 p_1_2)
	(adjacent p_1_1 p_0_1)
	(adjacent p_1_1 p_1_0)
	(adjacent p_1_2 p_2_2)
	(adjacent p_1_2 p_1_3)
	(adjacent p_1_2 p_0_2)
	(adjacent p_1_2 p_1_1)
	(adjacent p_1_3 p_2_3)
	(adjacent p_1_3 p_1_4)
	(adjacent p_1_3 p_0_3)
	(adjacent p_1_3 p_1_2)
	(adjacent p_1_4 p_2_4)
	(adjacent p_1_4 p_0_4)
	(adjacent p_1_4 p_1_3)
	(adjacent p_2_0 p_3_0)
	(adjacent p_2_0 p_2_1)
	(adjacent p_2_0 p_1_0)
	(adjacent p_2_1 p_3_1)
	(adjacent p_2_1 p_2_2)
	(adjacent p_2_1 p_1_1)
	(adjacent p_2_1 p_2_0)
	(adjacent p_2_2 p_3_2)
	(adjacent p_2_2 p_2_3)
	(adjacent p_2_2 p_1_2)
	(adjacent p_2_2 p_2_1)
	(adjacent p_2_3 p_3_3)
	(adjacent p_2_3 p_2_4)
	(adjacent p_2_3 p_1_3)
	(adjacent p_2_3 p_2_2)
	(adjacent p_2_4 p_3_4)
	(adjacent p_2_4 p_1_4)
	(adjacent p_2_4 p_2_3)
	(adjacent p_3_0 p_4_0)
	(adjacent p_3_0 p_3_1)
	(adjacent p_3_0 p_2_0)
	(adjacent p_3_1 p_4_1)
	(adjacent p_3_1 p_3_2)
	(adjacent p_3_1 p_2_1)
	(adjacent p_3_1 p_3_0)
	(adjacent p_3_2 p_4_2)
	(adjacent p_3_2 p_3_3)
	(adjacent p_3_2 p_2_2)
	(adjacent p_3_2 p_3_1)
	(adjacent p_3_3 p_4_3)
	(adjacent p_3_3 p_3_4)
	(adjacent p_3_3 p_2_3)
	(adjacent p_3_3 p_3_2)
	(adjacent p_3_4 p_4_4)
	(adjacent p_3_4 p_2_4)
	(adjacent p_3_4 p_3_3)
	(adjacent p_4_0 p_4_1)
	(adjacent p_4_0 p_3_0)
	(adjacent p_4_1 p_4_2)
	(adjacent p_4_1 p_3_1)
	(adjacent p_4_1 p_4_0)
	(adjacent p_4_2 p_4_3)
	(adjacent p_4_2 p_3_2)
	(adjacent p_4_2 p_4_1)
	(adjacent p_4_3 p_4_4)
	(adjacent p_4_3 p_3_3)
	(adjacent p_4_3 p_4_2)
	(adjacent p_4_4 p_3_4)
	(adjacent p_4_4 p_4_3)
    (flow-end p_0_3 c_5)
	(flow-end p_2_4 c_5)
	(flow-end p_1_0 c_1)
	(flow-end p_3_2 c_1)
	(flow-end p_1_1 c_4)
	(flow-end p_2_2 c_4)
	(flow-end p_2_0 c_2)
	(flow-end p_3_1 c_2)
	(flow-end p_3_4 c_6)
	(flow-end p_4_3 c_6)
	(flow-end p_4_0 c_3)
	(flow-end p_4_2 c_3)
)

(:goal (and
    ;We avoid using forall due to the translator implementation generating axioms which 
    ;make it so we can't use many good planner heuristics.
    ;(forall (?c - color) (flow-complete ?c))
    ;(forall (?l - location) (not-empty ?l))
    (flow-complete c_5)
	(flow-complete c_1)
	(flow-complete c_4)
	(flow-complete c_2)
	(flow-complete c_6)
	(flow-complete c_3)
    (not-empty p_0_0)
	(not-empty p_0_1)
	(not-empty p_0_2)
	(not-empty p_0_3)
	(not-empty p_0_4)
	(not-empty p_1_0)
	(not-empty p_1_1)
	(not-empty p_1_2)
	(not-empty p_1_3)
	(not-empty p_1_4)
	(not-empty p_2_0)
	(not-empty p_2_1)
	(not-empty p_2_2)
	(not-empty p_2_3)
	(not-empty p_2_4)
	(not-empty p_3_0)
	(not-empty p_3_1)
	(not-empty p_3_2)
	(not-empty p_3_3)
	(not-empty p_3_4)
	(not-empty p_4_0)
	(not-empty p_4_1)
	(not-empty p_4_2)
	(not-empty p_4_3)
	(not-empty p_4_4)
))

)

; plan
1. (start p_3_4 c_6)
   deleted: (offboard) (empty p_3_4)
   added: (not-empty p_3_4) (flow-at p_3_4 c_6) (color-at p_3_4 c_6)
   goals met: 1 of 31
2. (move p_3_4 p_4_4 c_6)
   deleted: (flow-at p_3_4 c_6) (empty p_4_4)
   added: (flow-at p_4_4 c_6) (not-empty p_4_4) (color-at p_4_4 c_6)
   goals met: 2 of 31
3. (finish p_4_4 p_4_3 c_6)
   deleted: (flow-at p_4_4 c_6) (empty p_4_3)
   added: (not-empty p_4_3) (offboard) (color-at p_4_3 c_6) (flow-complete c_6)
   goals met: 4 of 31
4. (start p_2_0 c_2)
   deleted: (offboard) (empty p_2_0)
   added: (not-empty p_2_0) (flow-at p_2_0 c_2) (color-at p_2_0 c_2)
   goals met: 5 of 31
5. (move p_2_0 p_3_0 c_2)
   deleted: (flow-at p_2_0 c_2) (empty p_3_0)
   added: (flow-at p_3_0 c_2) (not-empty p_3_0) (color-at p_3_0 c_2)
   goals met: 6 of 31
6. (finish p_3_0 p_3_1 c_2)
   deleted: (flow-at p_3_0 c_2) (empty p_3_1)
   added: (not-empty p_3_1) (offboard) (color-at p_3_1 c_2) (flow-complete c_2)
   goals met: 8 of 31
7. (start p_1_1 c_4)
   deleted: (offboard) (empty p_1_1)
   added: (not-empty p_1_1) (flow-at p_1_1 c_4) (color-at p_1_1 c_4)
   goals met: 9 of 31
8. (move p_1_1 p_2_1 c_4)
   deleted: (flow-at p_1_1 c_4) (empty p_2_1)
   added: (flow-at p_2_1 c_4) (not-empty p_2_1) (color-at p_2_1 c_4)
   goals met: 10 of 31
9. (finish p_2_1 p_2_2 c_4)
   deleted: (flow-at p_2_1 c_4) (empty p_2_2)
   added: (not-empty p_2_2) (offboard) (color-at p_2_2 c_4) (flow-complete c_4)
   goals met: 12 of 31
10. (start p_4_2 c_3)
   deleted: (offboard) (empty p_4_2)
   added: (not-empty p_4_2) (flow-at p_4_2 c_3) (color-at p_4_2 c_3)
   goals met: 13 of 31
11. (move p_4_2 p_4_1 c_3)
   deleted: (flow-at p_4_2 c_3) (empty p_4_1)
   added: (flow-at p_4_1 c_3) (not-empty p_4_1) (color-at p_4_1 c_3)
   goals met: 14 of 31
12. (finish p_4_1 p_4_0 c_3)
   deleted: (flow-at p_4_1 c_3) (empty p_4_0)
   added: (not-empty p_4_0) (offboard) (color-at p_4_0 c_3) (flow-complete c_3)
   goals met: 16 of 31
13. (start p_1_0 c_1)
   deleted: (offboard) (empty p_1_0)
   added: (not-empty p_1_0) (flow-at p_1_0 c_1) (color-at p_1_0 c_1)
   goals met: 17 of 31
14. (move p_1_0 p_0_0 c_1)
   deleted: (flow-at p_1_0 c_1) (empty p_0_0)
   added: (flow-at p_0_0 c_1) (not-empty p_0_0) (color-at p_0_0 c_1)
   goals met: 18 of 31
15. (move p_0_0 p_0_1 c_1)
   deleted: (flow-at p_0_0 c_1) (empty p_0_1)
   added: (flow-at p_0_1 c_1) (not-empty p_0_1) (color-at p_0_1 c_1)
   goals met: 19 of 31
16. (move p_0_1 p_0_2 c_1)
   deleted: (flow-at p_0_1 c_1) (empty p_0_2)
   added: (flow-at p_0_2 c_1) (not-empty p_0_2) (color-at p_0_2 c_1)
   goals met: 20 of 31
17. (move p_0_2 p_1_2 c_1)
   deleted: (flow-at p_0_2 c_1) (empty p_1_2)
   added: (flow-at p_1_2 c_1) (not-empty p_1_2) (color-at p_1_2 c_1)
   goals met: 21 of 31
18. (move p_1_2 p_1_3 c_1)
   deleted: (flow-at p_1_2 c_1) (empty p_1_3)
   added: (flow-at p_1_3 c_1) (not-empty p_1_3) (color-at p_1_3 c_1)
   goals met: 22 of 31
19. (move p_1_3 p_2_3 c_1)
   deleted: (flow-at p_1_3 c_1) (empty p_2_3)
   added: (flow-at p_2_3 c_1) (not-empty p_2_3) (color-at p_2_3 c_1)
   goals met: 23 of 31
20. (move p_2_3 p_3_3 c_1)
   deleted: (flow-at p_2_3 c_1) (empty p_3_3)
   added: (flow-at p_3_3 c_1) (not-empty p_3_3) (color-at p_3_3 c_1)
   goals met: 24 of 31
21. (finish p_3_3 p_3_2 c_1)
   deleted: (flow-at p_3_3 c_1) (empty p_3_2)
   added: (not-empty p_3_2) (offboard) (color-at p_3_2 c_1) (flow-complete c_1)
   goals met: 26 of 31
22. (start p_2_4 c_5)
   deleted: (offboard) (empty p_2_4)
   added: (not-empty p_2_4) (flow-at p_2_4 c_5) (color-at p_2_4 c_5)
   goals met: 27 of 31
23. (move p_2_4 p_1_4 c_5)
   deleted: (flow-at p_2_4 c_5) (empty p_1_4)
   added: (flow-at p_1_4 c_5) (not-empty p_1_4) (color-at p_1_4 c_5)
   goals met: 28 of 31
24. (move p_1_4 p_0_4 c_5)
   deleted: (flow-at p_1_4 c_5) (empty p_0_4)
   added: (flow-at p_0_4 c_5) (not-empty p_0_4) (color-at p_0_4 c_5)
   goals met: 29 of 31
25. (finish p_0_4 p_0_3 c_5)
   deleted: (flow-at p_0_4 c_5) (empty p_0_3)
   added: (not-empty p_0_3) (offboard) (color-at p_0_3 c_5) (flow-complete c_5)
   goals met: 31 of 31
